Repository: rdrake/vibebot-v8
Catalog: plugins/llm/locales/*.po
Languages: de, fi, fr, it, nl, ru

source: Processing with %d image(s)...
de: Verarbeite mit %d Bild(ern)...
fi: Käsitellään %d kuva(a)...
fr: Traitement avec %d image(s)...
it: Elaborazione con %d immagine/i...
nl: Verwerken met %d afbeelding(en)...
ru: Обработка с %d изображением(ями)...

source: Code generated (%d lines): %s
de: Code generiert (%d Zeilen): %s
fi: Koodi generoitu (%d riviä): %s
fr: Code généré (%d lignes) : %s
it: Codice generato (%d righe): %s
nl: Code gegenereerd (%d regels): %s
ru: Код сгенерирован (%d строк): %s

source: Conversation context cleared. Starting fresh!
de: Konversationskontext gelöscht. Neuer Start!
fi: Keskustelukonteksti tyhjennetty. Aloitetaan alusta!
fr: Contexte de conversation effacé. Nouveau départ !
it: Contesto della conversazione cancellato. Si ricomincia!
nl: Gesprekscontext gewist. Opnieuw beginnen!
ru: Контекст разговора очищен. Начинаем заново!

source: No conversation context to clear.
de: Kein Konversationskontext zum Löschen vorhanden.
fi: Ei keskustelukontekstia tyhjennettäväksi.
fr: Aucun contexte de conversation à effacer.
it: Nessun contesto di conversazione da cancellare.
nl: Geen gesprekscontext om te wissen.
ru: Нет контекста разговора для очистки.

source: Error clearing context.
de: Fehler beim Löschen des Kontexts.
fi: Virhe kontekstin tyhjentämisessä.
fr: Erreur lors de l'effacement du contexte.
it: Errore durante la cancellazione del contesto.
nl: Fout bij het wissen van context.
ru: Ошибка очистки контекста.

source: API Key Status: ask=%s, code=%s, draw=%s
de: API-Schlüssel-Status: ask=%s, code=%s, draw=%s
fi: API-avainten tila: ask=%s, code=%s, draw=%s
fr: État des clés API : ask=%s, code=%s, draw=%s
it: Stato chiavi API: ask=%s, code=%s, draw=%s
nl: API-sleutelstatus: ask=%s, code=%s, draw=%s
ru: Статус API-ключей: ask=%s, code=%s, draw=%s

source: Error checking API key status.
de: Fehler bei der Überprüfung des API-Schlüssel-Status.
fi: Virhe API-avainten tilan tarkistuksessa.
fr: Erreur lors de la vérification de l'état des clés API.
it: Errore durante la verifica dello stato delle chiavi API.
nl: Fout bij het controleren van API-sleutelstatus.
ru: Ошибка проверки статуса API-ключей.

source: Rate limit reset for %s
de: Ratenlimit für %s zurückgesetzt
fi: Pyyntöraja nollattu käyttäjälle %s
it: Limite di richieste reimpostato per %s
nl: Limiet gereset voor %s
ru: Лимит запросов сброшен для %s

source: All rate limits reset
de: Alle Ratenlimits zurückgesetzt
fi: Kaikki pyyntörajat nollattu
it: Tutti i limiti di richieste reimpostati
nl: Alle limieten gereset
ru: Все лимиты запросов сброшены

source: Failed to reset rate limits
de: Zurücksetzen der Ratenlimits fehlgeschlagen
fi: Pyyntörajojen nollaus epäonnistui
it: Impossibile reimpostare i limiti di richieste
nl: Limieten resetten mislukt
ru: Не удалось сбросить лимиты запросов

source: Prompt cannot be empty
de: Eingabe darf nicht leer sein
fi: Kehote ei voi olla tyhjä
fr: L'invite ne peut pas être vide
it: Il prompt non può essere vuoto
nl: Prompt mag niet leeg zijn
ru: Запрос не может быть пустым

source: Prompt too long (max %d characters)
de: Eingabe zu lang (max. %d Zeichen)
fi: Kehote liian pitkä (enintään %d merkkiä)
fr: Invite trop longue (max %d caractères)
it: Prompt troppo lungo (max %d caratteri)
nl: Prompt te lang (max %d tekens)
ru: Запрос слишком длинный (макс. %d символов)

source: Error: %s timed out. Try again or simplify your request.
de: Fehler: %s Zeitüberschreitung. Versuchen Sie es erneut oder vereinfachen Sie Ihre Anfrage.
fi: Virhe: %s aikakatkaisu. Yritä uudelleen tai yksinkertaista pyyntöäsi.
fr: Erreur : %s a expiré. Réessayez ou simplifiez votre demande.
it: Errore: %s scaduto. Riprova o semplifica la tua richiesta.
nl: Fout: %s time-out. Probeer opnieuw of vereenvoudig je verzoek.
ru: Ошибка: %s превысил время ожидания. Попробуйте снова или упростите запрос.

source: Error: API rate limit reached. Please wait a few minutes and try again.
de: Fehler: API-Ratenlimit erreicht. Bitte warten Sie einige Minuten und versuchen Sie es erneut.
fi: Virhe: API-pyyntöraja saavutettu. Odota muutama minuutti ja yritä uudelleen.
fr: Erreur : Limite de requêtes API atteinte. Veuillez patienter quelques minutes et réessayer.
it: Errore: Limite di richieste API raggiunto. Attendi qualche minuto e riprova.
nl: Fout: API-limiet bereikt. Wacht een paar minuten en probeer opnieuw.
ru: Ошибка: Достигнут лимит API запросов. Пожалуйста, подождите несколько минут и попробуйте снова.

source: Error: Invalid API key for %s. Please check your configuration.
de: Fehler: Ungültiger API-Schlüssel für %s. Bitte überprüfen Sie Ihre Konfiguration.
fi: Virhe: Virheellinen API-avain %s:lle. Tarkista asetuksesi.
fr: Erreur : Clé API invalide pour %s. Veuillez vérifier votre configuration.
it: Errore: Chiave API non valida per %s. Verifica la tua configurazione.
nl: Fout: Ongeldige API-sleutel voor %s. Controleer je configuratie.
ru: Ошибка: Неверный API-ключ для %s. Пожалуйста, проверьте конфигурацию.

source: Error: Content violates AI safety policies. Please rephrase your request.
de: Fehler: Inhalt verstößt gegen KI-Sicherheitsrichtlinien. Bitte formulieren Sie Ihre Anfrage um.
fi: Virhe: Sisältö rikkoo tekoälyn turvallisuuskäytäntöjä. Muotoile pyyntösi uudelleen.
fr: Erreur : Le contenu viole les politiques de sécurité de l'IA. Veuillez reformuler votre demande.
it: Errore: Il contenuto viola le politiche di sicurezza dell'IA. Riformula la tua richiesta.
nl: Fout: Inhoud schendt AI-veiligheidsbeleid. Herformuleer je verzoek.
ru: Ошибка: Содержимое нарушает политики безопасности ИИ. Пожалуйста, переформулируйте запрос.

source: Error: API returned an error. Check logs for details.
de: Fehler: API hat einen Fehler zurückgegeben. Überprüfen Sie die Logs für Details.
fi: Virhe: API palautti virheen. Tarkista lokit lisätietoja varten.
fr: Erreur : L'API a renvoyé une erreur. Consultez les logs pour plus de détails.
it: Errore: L'API ha restituito un errore. Controlla i log per i dettagli.
nl: Fout: API gaf een fout terug. Bekijk de logs voor details.
ru: Ошибка: API вернул ошибку. Проверьте логи для подробностей.

source: Error: Unable to complete %s. Check your configuration or try again later.
de: Fehler: %s konnte nicht abgeschlossen werden. Überprüfen Sie Ihre Konfiguration oder versuchen Sie es später erneut.
fi: Virhe: %s ei voitu suorittaa loppuun. Tarkista asetuksesi tai yritä myöhemmin.
fr: Erreur : Impossible de terminer %s. Vérifiez votre configuration ou réessayez plus tard.
it: Errore: Impossibile completare %s. Verifica la configurazione o riprova più tardi.
nl: Fout: Kan %s niet voltooien. Controleer je configuratie of probeer later opnieuw.
ru: Ошибка: Не удалось завершить %s. Проверьте конфигурацию или попробуйте позже.

source: Error: %s
de: Fehler: %s
fi: Virhe: %s
fr: Erreur : %s
it: Errore: %s
nl: Fout: %s
ru: Ошибка: %s

source: Error: API key not configured for %s command
de: Fehler: API-Schlüssel für %s-Befehl nicht konfiguriert
fi: Virhe: API-avainta ei ole määritetty %s-komennolle
fr: Erreur : Clé API non configurée pour la commande %s
it: Errore: Chiave API non configurata per il comando %s
nl: Fout: API-sleutel niet geconfigureerd voor %s-commando
ru: Ошибка: API-ключ не настроен для команды %s

source: Error: API key not configured for draw command
de: Fehler: API-Schlüssel für draw-Befehl nicht konfiguriert
fi: Virhe: API-avainta ei ole määritetty draw-komennolle
fr: Erreur : Clé API non configurée pour la commande draw
it: Errore: Chiave API non configurata per il comando draw
nl: Fout: API-sleutel niet geconfigureerd voor draw-commando
ru: Ошибка: API-ключ не настроен для команды draw

source: Error: Failed to save generated image
de: Fehler: Generiertes Bild konnte nicht gespeichert werden
fi: Virhe: Luodun kuvan tallennus epäonnistui
fr: Erreur : Échec de l'enregistrement de l'image générée
it: Errore: Impossibile salvare l'immagine generata
nl: Fout: Opslaan van gegenereerde afbeelding mislukt
ru: Ошибка: Не удалось сохранить сгенерированное изображение

source: Error: No image data in response
de: Fehler: Keine Bilddaten in der Antwort
fi: Virhe: Vastauksessa ei ole kuvatietoja

source: Error: No image generated. The prompt may have been blocked by content safety filters. Try rephrasing your request.
fr: Erreur : Aucune image générée. L'invite a peut-être été bloquée par les filtres de sécurité. Essayez de reformuler votre demande.
it: Errore: Nessuna immagine generata. Il prompt potrebbe essere stato bloccato dai filtri di sicurezza. Prova a riformulare la tua richiesta.
nl: Fout: Geen afbeelding gegenereerd. De prompt is mogelijk geblokkeerd door veiligheidsfilters. Probeer je verzoek te herformuleren.
ru: Ошибка: Изображение не создано. Запрос мог быть заблокирован фильтрами безопасности. Попробуйте переформулировать запрос.
